bigbass1997/PICTAS/firmware/viz/p18f27k42.inc
SCANLADR8        EQU  H'0000'
SCANLADR9        EQU  H'0001'
SCANLADR10       EQU  H'0002'
SCANLADR11       EQU  H'0003'
SCANLADR12       EQU  H'0004'
SCANLADR13       EQU  H'0005'
SCANLADR14       EQU  H'0006'
SCANLADR15       EQU  H'0007'


;----- SCANLADRU Bits -----------------------------------------------------
LADR16           EQU  H'0000'
LADR17           EQU  H'0001'
LADR18           EQU  H'0002'
LADR19           EQU  H'0003'
LADR20           EQU  H'0004'
LADR21           EQU  H'0005'


SCANLADR16       EQU  H'0000'
SCANLADR17       EQU  H'0001'
SCANLADR18       EQU  H'0002'
SCANLADR19       EQU  H'0003'
SCANLADR20       EQU  H'0004'
SCANLADR21       EQU  H'0005'


;----- SCANHADRL Bits -----------------------------------------------------
HADR0            EQU  H'0000'
HADR1            EQU  H'0001'
HADR2            EQU  H'0002'
HADR3            EQU  H'0003'
HADR4            EQU  H'0004'
HADR5            EQU  H'0005'
HADR6            EQU  H'0006'
HADR7            EQU  H'0007'


SCANHADR0        EQU  H'0000'
SCANHADR1        EQU  H'0001'
SCANHADR2        EQU  H'0002'
SCANHADR3        EQU  H'0003'
SCANHADR4        EQU  H'0004'
SCANHADR5        EQU  H'0005'
SCANHADR6        EQU  H'0006'
SCANHADR7        EQU  H'0007'


;----- SCANHADRH Bits -----------------------------------------------------
HADR8            EQU  H'0000'
HADR9            EQU  H'0001'
HADR10           EQU  H'0002'
HADR11           EQU  H'0003'
HADR12           EQU  H'0004'
HADR13           EQU  H'0005'
HADR14           EQU  H'0006'
HADR15           EQU  H'0007'


SCANHADR8        EQU  H'0000'
SCANHADR9        EQU  H'0001'
SCANHADR10       EQU  H'0002'
SCANHADR11       EQU  H'0003'
SCANHADR12       EQU  H'0004'
SCANHADR13       EQU  H'0005'
SCANHADR14       EQU  H'0006'
SCANHADR15       EQU  H'0007'


;----- SCANHADRU Bits -----------------------------------------------------
HADR16           EQU  H'0000'
HADR17           EQU  H'0001'
HADR18           EQU  H'0002'
HADR19           EQU  H'0003'
HADR20           EQU  H'0004'
HADR21           EQU  H'0005'


SCANHADR16       EQU  H'0000'
SCANHADR17       EQU  H'0001'
SCANHADR18       EQU  H'0002'
SCANHADR19       EQU  H'0003'
SCANHADR20       EQU  H'0004'
SCANHADR21       EQU  H'0005'


;----- SCANCON0 Bits -----------------------------------------------------
BUSY_SCANCON0    EQU  H'0000'
BURSTMD          EQU  H'0001'
MREG             EQU  H'0002'
SGO              EQU  H'0005'
TRIGEN           EQU  H'0006'
EN               EQU  H'0007'


;----- IPR0 Bits -----------------------------------------------------
SWIP             EQU  H'0000'
HLVDIP           EQU  H'0001'
OSFIP            EQU  H'0002'
CSWIP            EQU  H'0003'
NVMIP            EQU  H'0004'
SCANIP           EQU  H'0005'
CRCIP            EQU  H'0006'
IOCIP            EQU  H'0007'


;----- IPR1 Bits -----------------------------------------------------
INT0IP           EQU  H'0000'
ZCDIP            EQU  H'0001'
ADIP             EQU  H'0002'
ADTIP            EQU  H'0003'
C1IP             EQU  H'0004'
SMT1IP           EQU  H'0005'
SMT1PRAIP        EQU  H'0006'
SMT1PWAIP        EQU  H'0007'


;----- IPR2 Bits -----------------------------------------------------
DMA1SCNTIP       EQU  H'0000'
DMA1DCNTIP       EQU  H'0001'
DMA1ORIP         EQU  H'0002'
DMA1AIP          EQU  H'0003'
SPI1RXIP         EQU  H'0004'
SPI1TXIP         EQU  H'0005'
SPI1IP           EQU  H'0006'
I2C1RXIP         EQU  H'0007'


;----- IPR3 Bits -----------------------------------------------------
I2C1TXIP         EQU  H'0000'
I2C1IP           EQU  H'0001'
I2C1EIP          EQU  H'0002'
U1RXIP           EQU  H'0003'
U1TXIP           EQU  H'0004'
U1EIP            EQU  H'0005'
U1IP             EQU  H'0006'
TMR0IP           EQU  H'0007'


;----- IPR4 Bits -----------------------------------------------------
TMR1IP           EQU  H'0000'
TMR1GIP          EQU  H'0001'
TMR2IP           EQU  H'0002'
CCP1IP           EQU  H'0003'
NCO1IP           EQU  H'0005'
CWG1IP           EQU  H'0006'
CLC1IP           EQU  H'0007'


;----- IPR5 Bits -----------------------------------------------------
INT1IP           EQU  H'0000'
C2IP             EQU  H'0001'
DMA2SCNTIP       EQU  H'0002'
DMA2DCNTIP       EQU  H'0003'
DMA2ORIP         EQU  H'0004'
DMA2AIP          EQU  H'0005'
I2C2RXIP         EQU  H'0006'
I2C2TXIP         EQU  H'0007'


;----- IPR6 Bits -----------------------------------------------------
I2C2IP           EQU  H'0000'
I2C2EIP          EQU  H'0001'
U2RXIP           EQU  H'0002'
U2TXIP           EQU  H'0003'
U2EIP            EQU  H'0004'
U2IP             EQU  H'0005'
TMR3IP           EQU  H'0006'
TMR3GIP          EQU  H'0007'


;----- IPR7 Bits -----------------------------------------------------
TMR4IP           EQU  H'0000'
CCP2IP           EQU  H'0001'
CWG2IP           EQU  H'0003'
CLC2IP           EQU  H'0004'
INT2IP           EQU  H'0005'


;----- IPR8 Bits -----------------------------------------------------
TMR5IP           EQU  H'0006'
TMR5GIP          EQU  H'0007'


;----- IPR9 Bits -----------------------------------------------------
TMR6IP           EQU  H'0000'
CCP3IP           EQU  H'0001'
CWG3IP           EQU  H'0002'
CLC3IP           EQU  H'0003'


;----- IPR10 Bits -----------------------------------------------------
CCP4IP           EQU  H'0000'
CLC4IP           EQU  H'0001'


;----- PIE0 Bits -----------------------------------------------------
SWIE             EQU  H'0000'
HLVDIE           EQU  H'0001'
OSFIE            EQU  H'0002'
CSWIE            EQU  H'0003'
NVMIE            EQU  H'0004'
SCANIE           EQU  H'0005'
CRCIE            EQU  H'0006'
IOCIE            EQU  H'0007'


;----- PIE1 Bits -----------------------------------------------------
INT0IE           EQU  H'0000'
ZCDIE            EQU  H'0001'
ADIE             EQU  H'0002'
ADTIE            EQU  H'0003'
C1IE             EQU  H'0004'
SMT1IE           EQU  H'0005'
SMT1PRAIE        EQU  H'0006'
SMT1PWAIE        EQU  H'0007'


;----- PIE2 Bits -----------------------------------------------------
DMA1SCNTIE       EQU  H'0000'
DMA1DCNTIE       EQU  H'0001'
DMA1ORIE         EQU  H'0002'
DMA1AIE          EQU  H'0003'
SPI1RXIE         EQU  H'0004'
SPI1TXIE         EQU  H'0005'
SPI1IE           EQU  H'0006'
I2C1RXIE         EQU  H'0007'


