bigbass1997/PICTAS/firmware/viz/p18f27k42.inc
;----- WPUC Bits -----------------------------------------------------
WPUC0            EQU  H'0000'
WPUC1            EQU  H'0001'
WPUC2            EQU  H'0002'
WPUC3            EQU  H'0003'
WPUC4            EQU  H'0004'
WPUC5            EQU  H'0005'
WPUC6            EQU  H'0006'
WPUC7            EQU  H'0007'


;----- ODCONC Bits -----------------------------------------------------
ODCC0            EQU  H'0000'
ODCC1            EQU  H'0001'
ODCC2            EQU  H'0002'
ODCC3            EQU  H'0003'
ODCC4            EQU  H'0004'
ODCC5            EQU  H'0005'
ODCC6            EQU  H'0006'
ODCC7            EQU  H'0007'


;----- SLRCONC Bits -----------------------------------------------------
SLRC0            EQU  H'0000'
SLRC1            EQU  H'0001'
SLRC2            EQU  H'0002'
SLRC3            EQU  H'0003'
SLRC4            EQU  H'0004'
SLRC5            EQU  H'0005'
SLRC6            EQU  H'0006'
SLRC7            EQU  H'0007'


;----- INLVLC Bits -----------------------------------------------------
INLVLC0          EQU  H'0000'
INLVLC1          EQU  H'0001'
INLVLC2          EQU  H'0002'
INLVLC3          EQU  H'0003'
INLVLC4          EQU  H'0004'
INLVLC5          EQU  H'0005'
INLVLC6          EQU  H'0006'
INLVLC7          EQU  H'0007'


;----- IOCCP Bits -----------------------------------------------------
IOCCP0           EQU  H'0000'
IOCCP1           EQU  H'0001'
IOCCP2           EQU  H'0002'
IOCCP3           EQU  H'0003'
IOCCP4           EQU  H'0004'
IOCCP5           EQU  H'0005'
IOCCP6           EQU  H'0006'
IOCCP7           EQU  H'0007'


;----- IOCCN Bits -----------------------------------------------------
IOCCN0           EQU  H'0000'
IOCCN1           EQU  H'0001'
IOCCN2           EQU  H'0002'
IOCCN3           EQU  H'0003'
IOCCN4           EQU  H'0004'
IOCCN5           EQU  H'0005'
IOCCN6           EQU  H'0006'
IOCCN7           EQU  H'0007'


;----- IOCCF Bits -----------------------------------------------------
IOCCF0           EQU  H'0000'
IOCCF1           EQU  H'0001'
IOCCF2           EQU  H'0002'
IOCCF3           EQU  H'0003'
IOCCF4           EQU  H'0004'
IOCCF5           EQU  H'0005'
IOCCF6           EQU  H'0006'
IOCCF7           EQU  H'0007'


;----- RC3I2C Bits -----------------------------------------------------
SLEW             EQU  H'0006'

TH0              EQU  H'0000'
TH1              EQU  H'0001'
PU0              EQU  H'0004'
PU1              EQU  H'0005'

I2CSLEW          EQU  H'0006'

I2CTH0           EQU  H'0000'
I2CTH1           EQU  H'0001'
I2CPU0           EQU  H'0004'
I2CPU1           EQU  H'0005'


;----- RC4I2C Bits -----------------------------------------------------
SLEW             EQU  H'0006'

TH0              EQU  H'0000'
TH1              EQU  H'0001'
PU0              EQU  H'0004'
PU1              EQU  H'0005'

I2CSLEW          EQU  H'0006'

I2CTH0           EQU  H'0000'
I2CTH1           EQU  H'0001'
I2CPU0           EQU  H'0004'
I2CPU1           EQU  H'0005'


;----- WPUE Bits -----------------------------------------------------
WPUE3            EQU  H'0003'


;----- INLVLE Bits -----------------------------------------------------
INLVLE3          EQU  H'0003'


;----- IOCEP Bits -----------------------------------------------------
IOCEP3           EQU  H'0003'


;----- IOCEN Bits -----------------------------------------------------
IOCEN3           EQU  H'0003'


;----- IOCEF Bits -----------------------------------------------------
IOCEF3           EQU  H'0003'


;----- PPSLOCK Bits -----------------------------------------------------
PPSLOCKED        EQU  H'0000'


;----- DMA2BUF Bits -----------------------------------------------------
BUF0             EQU  H'0000'
BUF1             EQU  H'0001'
BUF2             EQU  H'0002'
BUF3             EQU  H'0003'
BUF4             EQU  H'0004'
BUF5             EQU  H'0005'
BUF6             EQU  H'0006'
BUF7             EQU  H'0007'


DMA2BUF0         EQU  H'0000'
DMA2BUF1         EQU  H'0001'
DMA2BUF2         EQU  H'0002'
DMA2BUF3         EQU  H'0003'
DMA2BUF4         EQU  H'0004'
DMA2BUF5         EQU  H'0005'
DMA2BUF6         EQU  H'0006'
DMA2BUF7         EQU  H'0007'


;----- DMA2DCNTL Bits -----------------------------------------------------
DCNT0            EQU  H'0000'
DCNT1            EQU  H'0001'
DCNT2            EQU  H'0002'
DCNT3            EQU  H'0003'
DCNT4            EQU  H'0004'
DCNT5            EQU  H'0005'
DCNT6            EQU  H'0006'
DCNT7            EQU  H'0007'


DMA2DCNT0        EQU  H'0000'
DMA2DCNT1        EQU  H'0001'
DMA2DCNT2        EQU  H'0002'
DMA2DCNT3        EQU  H'0003'
DMA2DCNT4        EQU  H'0004'
DMA2DCNT5        EQU  H'0005'
DMA2DCNT6        EQU  H'0006'
DMA2DCNT7        EQU  H'0007'


;----- DMA2DCNTH Bits -----------------------------------------------------
DCNT8            EQU  H'0000'
DCNT9            EQU  H'0001'
DCNT10           EQU  H'0002'
DCNT11           EQU  H'0003'


DMA2DCNT8        EQU  H'0000'
DMA2DCNT9        EQU  H'0001'
DMA2DCNT10       EQU  H'0002'
DMA2DCNT11       EQU  H'0003'


;----- DMA2DPTRL Bits -----------------------------------------------------
DPTR0            EQU  H'0000'
DPTR1            EQU  H'0001'
DPTR2            EQU  H'0002'
DPTR3            EQU  H'0003'
DPTR4            EQU  H'0004'
DPTR5            EQU  H'0005'
DPTR6            EQU  H'0006'
DPTR7            EQU  H'0007'


DMA2DPTR0        EQU  H'0000'
DMA2DPTR1        EQU  H'0001'
DMA2DPTR2        EQU  H'0002'
DMA2DPTR3        EQU  H'0003'
DMA2DPTR4        EQU  H'0004'
DMA2DPTR5        EQU  H'0005'
DMA2DPTR6        EQU  H'0006'
DMA2DPTR7        EQU  H'0007'


;----- DMA2DPTRH Bits -----------------------------------------------------
DPTR8            EQU  H'0000'
DPTR9            EQU  H'0001'
DPTR10           EQU  H'0002'
DPTR11           EQU  H'0003'
DPTR12           EQU  H'0004'
DPTR13           EQU  H'0005'
DPTR14           EQU  H'0006'
DPTR15           EQU  H'0007'


DMA2DPTR8        EQU  H'0000'
DMA2DPTR9        EQU  H'0001'
DMA2DPTR10       EQU  H'0002'
DMA2DPTR11       EQU  H'0003'
DMA2DPTR12       EQU  H'0004'
DMA2DPTR13       EQU  H'0005'
DMA2DPTR14       EQU  H'0006'
DMA2DPTR15       EQU  H'0007'


;----- DMA2DSZL Bits -----------------------------------------------------
DSZ0             EQU  H'0000'
DSZ1             EQU  H'0001'
DSZ2             EQU  H'0002'
DSZ3             EQU  H'0003'
DSZ4             EQU  H'0004'
DSZ5             EQU  H'0005'
DSZ6             EQU  H'0006'
DSZ7             EQU  H'0007'

DMA2DSZ0         EQU  H'0000'
DMA2DSZ1         EQU  H'0001'
DMA2DSZ2         EQU  H'0002'
DMA2DSZ3         EQU  H'0003'
DMA2DSZ4         EQU  H'0004'
DMA2DSZ5         EQU  H'0005'
DMA2DSZ6         EQU  H'0006'
DMA2DSZ7         EQU  H'0007'


;----- DMA2DSZH Bits -----------------------------------------------------
DSZ8             EQU  H'0000'
DSZ9             EQU  H'0001'
DSZ10            EQU  H'0002'
DSZ11            EQU  H'0003'

DMA2DSZ8         EQU  H'0000'
DMA2DSZ9         EQU  H'0001'
DMA2DSZ10        EQU  H'0002'
DMA2DSZ11        EQU  H'0003'


;----- DMA2DSAL Bits -----------------------------------------------------
SSA0             EQU  H'0000'
SSA1             EQU  H'0001'
SSA2             EQU  H'0002'
SSA3             EQU  H'0003'
SSA4             EQU  H'0004'
SSA5             EQU  H'0005'
SSA6             EQU  H'0006'
SSA7             EQU  H'0007'


DMA2DSA0         EQU  H'0000'
DMA2DSA1         EQU  H'0001'
DMA2DSA2         EQU  H'0002'
DMA2DSA3         EQU  H'0003'
DMA2DSA4         EQU  H'0004'
DMA2DSA5         EQU  H'0005'
DMA2DSA6         EQU  H'0006'
DMA2DSA7         EQU  H'0007'


