bigbass1997/PICTAS/firmware/viz/p18f27k42.inc
;----- DMA1BUF Bits -----------------------------------------------------
BUF0             EQU  H'0000'
BUF1             EQU  H'0001'
BUF2             EQU  H'0002'
BUF3             EQU  H'0003'
BUF4             EQU  H'0004'
BUF5             EQU  H'0005'
BUF6             EQU  H'0006'
BUF7             EQU  H'0007'


DMA1BUF0         EQU  H'0000'
DMA1BUF1         EQU  H'0001'
DMA1BUF2         EQU  H'0002'
DMA1BUF3         EQU  H'0003'
DMA1BUF4         EQU  H'0004'
DMA1BUF5         EQU  H'0005'
DMA1BUF6         EQU  H'0006'
DMA1BUF7         EQU  H'0007'


;----- DMA1DCNTL Bits -----------------------------------------------------
DCNT0            EQU  H'0000'
DCNT1            EQU  H'0001'
DCNT2            EQU  H'0002'
DCNT3            EQU  H'0003'
DCNT4            EQU  H'0004'
DCNT5            EQU  H'0005'
DCNT6            EQU  H'0006'
DCNT7            EQU  H'0007'


DMA1DCNT0        EQU  H'0000'
DMA1DCNT1        EQU  H'0001'
DMA1DCNT2        EQU  H'0002'
DMA1DCNT3        EQU  H'0003'
DMA1DCNT4        EQU  H'0004'
DMA1DCNT5        EQU  H'0005'
DMA1DCNT6        EQU  H'0006'
DMA1DCNT7        EQU  H'0007'


;----- DMA1DCNTH Bits -----------------------------------------------------
DCNT8            EQU  H'0000'
DCNT9            EQU  H'0001'
DCNT10           EQU  H'0002'
DCNT11           EQU  H'0003'


DMA1DCNT8        EQU  H'0000'
DMA1DCNT9        EQU  H'0001'
DMA1DCNT10       EQU  H'0002'
DMA1DCNT11       EQU  H'0003'


;----- DMA1DPTRL Bits -----------------------------------------------------
DPTR0            EQU  H'0000'
DPTR1            EQU  H'0001'
DPTR2            EQU  H'0002'
DPTR3            EQU  H'0003'
DPTR4            EQU  H'0004'
DPTR5            EQU  H'0005'
DPTR6            EQU  H'0006'
DPTR7            EQU  H'0007'


DMA1DPTR0        EQU  H'0000'
DMA1DPTR1        EQU  H'0001'
DMA1DPTR2        EQU  H'0002'
DMA1DPTR3        EQU  H'0003'
DMA1DPTR4        EQU  H'0004'
DMA1DPTR5        EQU  H'0005'
DMA1DPTR6        EQU  H'0006'
DMA1DPTR7        EQU  H'0007'


;----- DMA1DPTRH Bits -----------------------------------------------------
DPTR8            EQU  H'0000'
DPTR9            EQU  H'0001'
DPTR10           EQU  H'0002'
DPTR11           EQU  H'0003'
DPTR12           EQU  H'0004'
DPTR13           EQU  H'0005'
DPTR14           EQU  H'0006'
DPTR15           EQU  H'0007'


DMA1DPTR8        EQU  H'0000'
DMA1DPTR9        EQU  H'0001'
DMA1DPTR10       EQU  H'0002'
DMA1DPTR11       EQU  H'0003'
DMA1DPTR12       EQU  H'0004'
DMA1DPTR13       EQU  H'0005'
DMA1DPTR14       EQU  H'0006'
DMA1DPTR15       EQU  H'0007'


;----- DMA1DSZL Bits -----------------------------------------------------
DSZ0             EQU  H'0000'
DSZ1             EQU  H'0001'
DSZ2             EQU  H'0002'
DSZ3             EQU  H'0003'
DSZ4             EQU  H'0004'
DSZ5             EQU  H'0005'
DSZ6             EQU  H'0006'
DSZ7             EQU  H'0007'

DMA1DSZ0         EQU  H'0000'
DMA1DSZ1         EQU  H'0001'
DMA1DSZ2         EQU  H'0002'
DMA1DSZ3         EQU  H'0003'
DMA1DSZ4         EQU  H'0004'
DMA1DSZ5         EQU  H'0005'
DMA1DSZ6         EQU  H'0006'
DMA1DSZ7         EQU  H'0007'


;----- DMA1DSZH Bits -----------------------------------------------------
DSZ8             EQU  H'0000'
DSZ9             EQU  H'0001'
DSZ10            EQU  H'0002'
DSZ11            EQU  H'0003'

DMA1DSZ8         EQU  H'0000'
DMA1DSZ9         EQU  H'0001'
DMA1DSZ10        EQU  H'0002'
DMA1DSZ11        EQU  H'0003'


;----- DMA1DSAL Bits -----------------------------------------------------
SSA0             EQU  H'0000'
SSA1             EQU  H'0001'
SSA2             EQU  H'0002'
SSA3             EQU  H'0003'
SSA4             EQU  H'0004'
SSA5             EQU  H'0005'
SSA6             EQU  H'0006'
SSA7             EQU  H'0007'


DMA1DSA0         EQU  H'0000'
DMA1DSA1         EQU  H'0001'
DMA1DSA2         EQU  H'0002'
DMA1DSA3         EQU  H'0003'
DMA1DSA4         EQU  H'0004'
DMA1DSA5         EQU  H'0005'
DMA1DSA6         EQU  H'0006'
DMA1DSA7         EQU  H'0007'


;----- DMA1DSAH Bits -----------------------------------------------------
DSA8             EQU  H'0000'
DSA9             EQU  H'0001'
DSA10            EQU  H'0002'
DSA11            EQU  H'0003'
DSA12            EQU  H'0004'
DSA13            EQU  H'0005'
DSA14            EQU  H'0006'
DSA15            EQU  H'0007'


DMA1DSA8         EQU  H'0000'
DMA1DSA9         EQU  H'0001'
DMA1DSA10        EQU  H'0002'
DMA1DSA11        EQU  H'0003'
DMA1DSA12        EQU  H'0004'
DMA1DSA13        EQU  H'0005'
DMA1DSA14        EQU  H'0006'
DMA1DSA15        EQU  H'0007'


;----- DMA1SCNTL Bits -----------------------------------------------------
SCNT0            EQU  H'0000'
SCNT1            EQU  H'0001'
SCNT2            EQU  H'0002'
SCNT3            EQU  H'0003'
SCNT4            EQU  H'0004'
SCNT5            EQU  H'0005'
SCNT6            EQU  H'0006'
SCNT7            EQU  H'0007'


DMA1SCNT0        EQU  H'0000'
DMA1SCNT1        EQU  H'0001'
DMA1SCNT2        EQU  H'0002'
DMA1SCNT3        EQU  H'0003'
DMA1SCNT4        EQU  H'0004'
DMA1SCNT5        EQU  H'0005'
DMA1SCNT6        EQU  H'0006'
DMA1SCNT7        EQU  H'0007'


;----- DMA1SCNTH Bits -----------------------------------------------------
SCNT8            EQU  H'0000'
SCNT9            EQU  H'0001'
SCNT10           EQU  H'0002'
SCNT11           EQU  H'0003'


DMA1SCNT8        EQU  H'0000'
DMA1SCNT9        EQU  H'0001'
DMA1SCNT10       EQU  H'0002'
DMA1SCNT11       EQU  H'0003'


;----- DMA1SPTRL Bits -----------------------------------------------------
SPTR0            EQU  H'0000'
SPTR1            EQU  H'0001'
SPTR2            EQU  H'0002'
SPTR3            EQU  H'0003'
SPTR4            EQU  H'0004'
SPTR5            EQU  H'0005'
SPTR6            EQU  H'0006'
SPTR7            EQU  H'0007'


DMA1SPTR0        EQU  H'0000'
DMA1SPTR1        EQU  H'0001'
DMA1SPTR2        EQU  H'0002'
DMA1SPTR3        EQU  H'0003'
DMA1SPTR4        EQU  H'0004'
DMA1SPTR5        EQU  H'0005'
DMA1SPTR6        EQU  H'0006'
DMA1SPTR7        EQU  H'0007'


;----- DMA1SPTRH Bits -----------------------------------------------------
SPTR8            EQU  H'0000'
SPTR9            EQU  H'0001'
SPTR10           EQU  H'0002'
SPTR11           EQU  H'0003'
SPTR12           EQU  H'0004'
SPTR13           EQU  H'0005'
SPTR14           EQU  H'0006'
SPTR15           EQU  H'0007'


DMA1SPTR8        EQU  H'0000'
DMA1SPTR9        EQU  H'0001'
DMA1SPTR10       EQU  H'0002'
DMA1SPTR11       EQU  H'0003'
DMA1SPTR12       EQU  H'0004'
DMA1SPTR13       EQU  H'0005'
DMA1SPTR14       EQU  H'0006'
DMA1SPTR15       EQU  H'0007'


